name: "clip_visual"
platform: "tensorrt_plan"
max_batch_size: 8

input [
  {
    name: "input"
    data_type: TYPE_FP16
    dims: [3, 224, 224]
  }
]

output [
  {
    name: "embedding"
    data_type: TYPE_FP16
    dims: [512]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
